{"annotated_passages": {"=== Image img_001: Alex at sister's wedding ceremony in June 2020 ===\nAlex attended his sister's wedding ceremony in June 2020. The ceremony was held at a beautiful church, followed by a reception at a grand hall. Alex felt immense joy and love as he watched his sister marry her beloved partner, who became his new brother-in-law.\n\n=== Image img_002: Alex's graduation from university in New York City ===\nAlex graduated from Columbia University in New York City. Professor Smith handed him his graduation diploma during the ceremony. Alex wore his cap and gown with pride, and his parents were there to witness this moment of great accomplishment.\n\n=== Image img_003: Family trip to Cappadocia, Turkey ===\nAlex shared a family trip to Cappadocia, Turkey with his mother, father, and sister. They took a hot air balloon ride over the breathtaking landscape. Alex captured many photos with his camera, and the entire family felt excitement, wonder, and a sense of adventure.\n\n=== Image img_004: Alex's 28th birthday celebration with best friend Sam ===\nAlex celebrated his 28th birthday on May 15, 2025. His best friend Sam organized a surprise party with their college friends. There was a beautiful birthday cake and thoughtful gifts. Alex felt overwhelming happiness and gratitude for having such caring friends in his life.\n\n=== Image img_005: Alex at his favorite café near Central Park ===\nAlex visited his favorite café, Bluebird Café, which is located nearby Central Park. Barista Maria, who knows him as a regular customer, served him his usual coffee. Alex brought his laptop and a novel, feeling peace and contentment in this special place.\n\n=== Image img_006: Alex volunteering at local animal shelter ===\nAlex volunteers at the local animal shelter where shelter coordinator Jane oversees operations. Alex helps care for dogs and cats, wearing his volunteer badge with pride. This work gives him a sense of compassion and fulfillment, knowing he's making a difference in animals' lives.\n\n=== Image img_007: Alex hiking with college roommate Mike ===\nAlex went on a hiking trip with his college roommate Mike to a challenging mountain trail. They reached the summit together, both wearing their hiking boots and carrying backpacks with water bottles. Alex felt determination during the climb and a great sense of achievement upon reaching the top.\n\n=== Person Profile ===\nAlex is 28 years old. Key relationships include Sister (married in 2020), Brother-in-law, Sam (best friend since college), Mike (college roommate and hiking buddy), Parents, Professor Smith (university mentor), Barista Maria (café regular), Jane (shelter coordinator). \nFavorite places are Bluebird Café, Central Park, Mountain trails. \nMemorable events include Sister's Wedding (June 2020), University Graduation (Columbia University), Family Trip to Turkey, 28th Birthday (May 15, 2025).": [["alex:PERSON", "favorite place", "bluebird café:LOCATION"], ["alex:PERSON", "key relationship", "brother-in-law:PERSON"], ["alex:PERSON", "key relationship", "sam:PERSON"], ["alex:PERSON", "key relationship", "parents:PERSON"], ["alex:PERSON", "memorable event", "university graduation:EVENT"], ["alex:PERSON", "volunteers at", "local animal shelter:LOCATION"], ["alex:PERSON", "favorite place", "mountain trails:LOCATION"], ["alex:PERSON", "key relationship", "mike:PERSON"], ["alex:PERSON", "memorable event", "family trip:EVENT"], ["alex:PERSON", "key relationship", "professor smith:PERSON"], ["alex:PERSON", "key relationship", "barista maria:PERSON"], ["alex:PERSON", "attended", "graduation:EVENT"], ["alex:PERSON", "memorable event", "28th birthday:EVENT"], ["sam:PERSON", "organized", "28th birthday:EVENT"], ["alex:PERSON", "attended", "sister's wedding ceremony:EVENT"], ["alex:PERSON", "went on", "hiking trip:EVENT"], ["alex:PERSON", "near", "central park:LOCATION"], ["alex:PERSON", "shared", "family trip:EVENT"], ["alex:PERSON", "graduated from", "columbia university:LOCATION"], ["alex:PERSON", "celebrated", "28th birthday:EVENT"], ["alex:PERSON", "hiking on", "mountain trail:LOCATION"], ["alex:PERSON", "memorable event", "sister's wedding:EVENT"], ["alex:PERSON", "key relationship", "sister:PERSON"], ["alex:PERSON", "key relationship", "jane:PERSON"]]}, "allowed_entity_types": ["PERSON", "EVENT", "LOCATION", "DATE", "EMOTION", "OBJECT", "RELATIONSHIP"]}